Repository: pypi-data/pypi-mirror-243
Catalog: packages/collective.ckeditortemplates/collective.ckeditortemplates-0.9.1.tar.gz/collective.ckeditortemplates-0.9.1/src/collective/ckeditortemplates/locales/*/LC_MESSAGES/plone.po
Languages: es

source: CK Template
es: Plantilla CKEditor

source: CK Template Folder
es: Carpeta Plantilla CK

source: CKEditor custom template
es: Plantilla personalizada CKEditor

source: CKEditor custom template folder
es: Carpeta Plantilla personalizada CKEditor

source: Comment about the last transition
es: Comenta sobre la última transición

source: Previous transition
es: Transición previa

source: Provides access to workflow history
es: Proveer acceso al historial de flujo de trabajo

source: The ID of the user who performed the last transition
es: El ID del usuario quien efectúa la ultima transición

source: When the previous transition was performed
es: Cuando se realizó la transición previa

source: cktemplate_workflow
es: Flujo de trabajo de plantilla de CKEditor

source: disable
es: Desactivar

source: disabled
es: Desactivado

source: enable
es: Activar

source: enabled
es: Activado
