Repository: pypi-data/pypi-mirror-243
Catalog: packages/xblock-grade-fetcher/xblock-grade-fetcher-0.5.0.tar.gz/xblock-grade-fetcher-0.5.0/gradefetcher/translations/*/LC_MESSAGES/text.po
Languages: es_419

source: Passed
es_419: Aprobado

source: Failed
es_419: Reprobado

source: Assignment
es_419: Asignación

source: Assignment {assignment_id}: <b>Passed</b>
es_419: Asignación {assignment_id}: <b>Aprobado</b>

source: Assignment {assignment_id}: <b>Failed</b> - {reason_api_text}
es_419: Asignación {assignment_id}: <b>Reprobado</b> - {reason_api_text}

source: Assignment {assignment_id}: - {reason_api_text}
es_419: Asignación {assignment_id}: - {reason_api_text}

source: You got {grade} score for this activity. Explanation: {reasons_msg}
es_419: Has obtenido {grade} en esta actividad. Explicación: {reasons_msg}

source: Assignment {assignment_id}: Failed
es_419: Asignación {assignment_id}: Reprobado

source: We cannot find your account on Customization. Please make sure that you have created your account. If you need assistance, please contact the course team.
es_419: No podemos encontrar tu cuenta en Personalización. Por favor, asegúrate de haber creado tu cuenta. Si necesitas ayuda, contacta al equipo del curso.

source: Something went wrong please try again.
es_419: Algo salió mal, por favor intenta de nuevo.

source: Loading
es_419: Cargando

source: You got
es_419: Has obtenido

source: score for this activity.
es_419: en esta actividad.

source: Explanation:
es_419: Explicación:

source: Click on the %(button_text)s button to see your score.
es_419: Haz clic en el botón %(button_text)s para ver tu calificación.

source: You got <span class='grade'>{grade}% </span> score for this activity.<br />Explanation: <span class='reason'><ul>{reasons_msg}</ul></span>
es_419: Has obtenido <span class='grade'>{grade}% </span> en esta actividad.<br />Explicación: <span class='reason'><ul>{reasons_msg}</ul></span>

source: button to see your score.
es_419: botón para ver tu calificación.

source: It seems that one of your data element groups is not assigned to a data element group set. Note: This does not affect your grade.
es_419: Parece que uno de tus grupos de elementos de datos no está asignado a un conjunto de grupos de elementos de datos. Nota: Esto no afecta tu calificación.

source: It seems that you have not created data elements yet. Note: This does not affect your grade, but it is preventing you from completing this set of assignments.
es_419: Parece que aún no has creado elementos de datos. Nota: Esto no afecta tu calificación, pero te impide completar este conjunto de tareas.

source: It seems that you have not created all of the three requested data element groups. Note: This does not affect your grade.
es_419: Parece que no has creado todos los tres grupos de elementos de datos solicitados. Nota: Esto no afecta tu calificación.

source: It seems that you have not assigned one or more of your data elements to your data element groups. Note: This does not affect your grade.
es_419: Parece que no has asignado uno o más de tus elementos de datos a tus grupos de elementos de datos. Nota: Esto no afecta tu calificación.

source: It seems that you have not created the six data elements as requested. Note: This does not affect your grade
es_419: Parece que no has creado los seis elementos de datos como se solicitó. Nota: Esto no afecta tu calificación.

source: It seems that no data set is currently assigned to your account. Please contact the course team.
es_419: Parece que actualmente ningún conjunto de datos está asignado a tu cuenta. Por favor, contacta al equipo del curso.

source: It seems that no data has been entered in your data set.
es_419: Parece que no se han ingresado datos en tu conjunto de datos.

source: It seems that you have not created all of the four requested organisation unit groups. Note: This does not affect your grade.
es_419: Parece que no has creado todos los cuatro grupos de unidades organizativas solicitados. Nota: Esto no afecta tu calificación.

source: It seems that you have not created the requested two organisation unit group sets. Note: This does not affect your grade.
es_419: Parece que no has creado los dos conjuntos de grupos de unidades organizativas solicitados. Nota: Esto no afecta tu calificación.

source: ERROR: We cannot find your account on Customization. Please make sure that you have created your account. If you need assistance, please contact the course team.
es_419: ERROR: No podemos encontrar tu cuenta en Customization. Por favor, asegúrate de haber creado tu cuenta. Si necesitas asistencia, por favor contacta al equipo del curso.

source: ERROR: Two or more Root Organisation Units have been assigned to your account. This is preventing us from assessing your assignments. Please contact the course team.
es_419: ERROR: Se han asignado dos o más Unidades Organizativas Raíz a tu cuenta. Esto nos impide evaluar tus tareas. Por favor contacta al equipo del curso.

source: It seems that you have not yet assigned your data elements to your data set, therefore you can't enter data. Check that data elements are assigned to the data set that was created for you.
es_419: Parece que aún no has asignado tus elementos de datos a tu conjunto de datos, por lo tanto, no puedes ingresar datos. Verifica que los elementos de datos estén asignados al conjunto de datos que fue creado para ti.

source: It seems that you have created none of the requested organisation units.
es_419: Parece que no has creado ninguna de las unidades organizativas solicitadas.

source: It seems that your data set is not yet assigned to any organisation units.
es_419: Parece que tu conjunto de datos aún no está asignado a ninguna unidad organizativa.

source: User did not create any Facility-level Org Units.
es_419: El usuario no ha creado ninguna Unidad Organizativa a nivel de instalación.

source: We could not find your Malaria program. Please make sure that the program that you want to be graded has the word 'Malaria' in its name.
es_419: No pudimos encontrar tu programa de Malaria. Por favor, asegúrate de que el programa que quieres que sea calificado tenga la palabra 'Malaria' en su nombre.

source: It seems that you have not assigned an organisation unit to your Malaria program.
es_419: Parece que no has asignado una unidad organizativa a tu programa de Malaria.

source: It seems that you have not assigned one or more of your data elements to your Malaria program.
es_419: Parece que no has asignado uno o más de tus elementos de datos a tu programa de Malaria.

source: It seems that you have not created an option set for your data elements that have been assigned to your Malaria program.
es_419: Parece que no has creado un conjunto de opciones para tus elementos de datos que han sido asignados a tu programa de Malaria.

source: It seems that you have not created options for your option set.
es_419: Parece que no has creado opciones para tu conjunto de opciones.

source: It seems like your program's data elements are not added to groups, or they are not of the Tracker type.
es_419: Parece que los elementos de datos de tu programa no están agregados a grupos, o no son del tipo Tracker.

source: It seems you have not created a section form for your Malaria program.
es_419: Parece que no has creado un formulario de sección para tu programa de Malaria.

source: It seems you have not assigned your user access to your Malaria program. Please check the sharing settings for your program and that you have access to both data and metadata.
es_419: Parece que no has asignado el acceso de tu usuario a tu programa de Malaria. Por favor, verifica la configuración de compartición de tu programa y que tienes acceso tanto a los datos como a los metadatos.

source: It seems that you have not created an event or have not entered any data into it for your Malaria program.
es_419: Parece que no has creado un evento o no has ingresado datos en él para tu programa de Malaria.
