def print_stack():
    print('Вам нужны объяснения? Y/N')
    select = input()
    if select.isalpha()==True:
        if select == 'Y':
            print("""
Сначала нужно создать глобальную переменную stack, для этого до функций пишем stack = []
Потом задаём ввод команд:



Далее Пишем основные команды:

def push(x):
    st.append(x) #добавляем в массив st, который имитирует стек, значение x. Оно добавляется в конец массива также, как это было бы сделано со стеком.
    print('ok')  #выводим ok
def pop():
    x = st.pop() #удаляем из массива st последнее значение. Это имитирует удаление элемента из стека т.к. в стеке элементы удаляются с конца,  и записываем в x удаленное значение
    return x     #возвращаем x
def back():
    return st[-1] #возвращаем последний элемент стека
def size():
    return len(st) # возвращаем длину стека (массива)
def clear():
    st.clear()  #очищаем стек (массив)
    print('ok') #выводим ok
def exit():
    print('bye') #выводим bye 
    break        #завершаем работу цикла

            """)
        else:
            print("""

            """)
    elif len(select) != 1:
        print('Необходимо ввести ОДНУ букву английского алфавита Y или N')
    else:
        print("Необходимо ввести одну БУКВУ английского алфавита Y или N")
