Repository: pypi-data/pypi-mirror-243
Catalog: packages/xblock-grade-fetcher/xblock_grade_fetcher-0.5.0-py3-none-any.whl/gradefetcher/translations/*/LC_MESSAGES/text.po
Languages: fr_ca

source: Passed
fr_ca: Réussi

source: Failed
fr_ca: Échoué

source: Assignment
fr_ca: Activité

source: Assignment {assignment_id}: <b>Passed</b>
fr_ca: Activité {assignment_id}: <b>Réussi</b>

source: Assignment {assignment_id}: <b>Failed</b> - {reason_api_text}
fr_ca: Activité {assignment_id}: <b>Échoué</b> - {reason_api_text}

source: Assignment {assignment_id}: - {reason_api_text}
fr_ca: Activité {assignment_id}: - {reason_api_text}

source: You got {grade} score for this activity. Explanation: {reasons_msg}
fr_ca: Vous avez obtenu {grade} pour cette activité. Explication: {reasons_msg}

source: Assignment {assignment_id}: Failed
fr_ca: Activité {assignment_id}: Échoué

source: We cannot find your account on Customization. Please make sure that you have created your account. If you need assistance, please contact the course team.
fr_ca: Nous ne trouvons pas votre compte sur la personnalisation. Veuillez vous assurer que vous avez créé votre compte. Si vous avez besoin d'aide, veuillez contacter l'équipe du cours.

source: Something went wrong please try again.
fr_ca: Une erreur s'est produite. Veuillez réessayer.

source: Loading
fr_ca: Chargement

source: You got
fr_ca: Vous avez obtenu

source: score for this activity.
fr_ca: pour cette activité.

source: Explanation:
fr_ca: Explication:

source: Click on the %(button_text)s button to see your score.
fr_ca: Cliquez sur le bouton %(button_text)s pour voir votre note.

source: You got <span class='grade'>{grade}% </span> score for this activity.<br />Explanation: <span class='reason'><ul>{reasons_msg}</ul></span>
fr_ca: Vous avez obtenu <span class='grade'>{grade}% </span> pour cette activité.<br />Explication:<span class='reason'><ul>{reasons_msg}</ul></span>

source: It seems that one of your data element groups is not assigned to a data element group set. Note: This does not affect your grade.
fr_ca: Il semble que l'un de vos groupes d'éléments de données ne soit rattaché à aucun ensemble de groupes d'éléments de données. Note : cela n'a pas d'incidence sur votre note.

source: It seems that you have not created data elements yet. Note: This does not affect your grade, but it is preventing you from completing this set of assignments.
fr_ca: Il semble que vous n'ayez pas encore créé d'éléments de données. Note : cela n'a pas d'incidence sur votre note, mais vous empêche de terminer cette série d'exercices.

source: It seems that you have not created all of the three requested data element groups. Note: This does not affect your grade.
fr_ca: Il semble que vous ayez omis de créer un ou plusieurs des trois groupes d'éléments de données demandés. Note : cela n'a pas d'incidence sur votre note.

source: It seems that you have not assigned one or more of your data elements to your data element groups. Note: This does not affect your grade.
fr_ca: Il semble que tous vos éléments de données ne soient pas rattachés à vos groupes d'éléments de données. Note : cela n'a pas d'incidence sur votre note.

source: It seems that you have not created the six data elements as requested. Note: This does not affect your grade
fr_ca: Il semble que vous ayez omis de créer un ou plusieurs des six éléments de données demandés. Note : cela n'a pas d'incidence sur votre note.

source: It seems that no data set is currently assigned to your account. Please contact the course team.
fr_ca: Il semble qu'aucun ensemble de données ne soit actuellement rattaché à votre compte. Veuillez contacter l'équipe pédagogique.

source: It seems that no data has been entered in your data set.
fr_ca: Il semble qu'aucune donnée n'ait été saisie dans votre ensemble de données.

source: It seems that you have not created all of the four requested organisation unit groups. Note: This does not affect your grade.
fr_ca: Il semble que vous ayez omis de créer les quatre groupes d'unités d'organisation demandés. Note : cela n'a pas d'incidence sur votre note.

source: It seems that you have not created the requested two organisation unit group sets. Note: This does not affect your grade.
fr_ca: Il semble que vous ayez omis de créer un ou les deux ensembles de groupes d'unités d'organisation demandés. Note : cela n'a pas d'incidence sur votre note.

source: ERROR: We cannot find your account on Customization. Please make sure that you have created your account. If you need assistance, please contact the course team.
fr_ca: ERREUR : Nous ne trouvons pas votre compte dans Customization. Veuillez vous vérifier que vous avez bien créé votre compte. Si vous avez besoin d'aide, veuillez contacter l'équipe pédagogique.

source: ERROR: Two or more Root Organisation Units have been assigned to your account. This is preventing us from assessing your assignments. Please contact the course team.
fr_ca: ERREUR : Deux unités d'organisation principales ou plus ont été rattachées à votre compte. Cela nous empêche d'évaluer vos exercices. Veuillez contacter l'équipe pédagogique.

source: It seems that you have not yet assigned your data elements to your data set, therefore you can't enter data. Check that data elements are assigned to the data set that was created for you.
fr_ca: Il semble que vous ayez omis de rattacher vos éléments de données à votre ensemble de données. Cela vous empêche de saisir des données. Assurez-vous que les éléments de données soient affectés à l'ensemble de données qui a été créé pour vous.

source: It seems that you have created none of the requested organisation units.
fr_ca: Il semble que vous ayez omis de créer les unités d'organisation demandées.

source: It seems that your data set is not yet assigned to any organisation units.
fr_ca: Il semble que votre ensemble de données ne soit rattaché à aucune de vos unités d'organisation.

source: User did not create any Facility-level Org Units.
fr_ca: L'utilisateur n'a créé aucune unité organisationnelle au niveau de l'établissement.

source: We could not find your Malaria program. Please make sure that the program that you want to be graded has the word 'Malaria' in its name.
fr_ca: Nous n'avons pas pu trouver votre programme sur le paludisme. Veuillez vous assurer que le programme que vous souhaitez voir noté comporte le mot 'Paludisme' ou 'Malaria' dans son nom.

source: It seems that you have not assigned an organisation unit to your Malaria program.
fr_ca: Il semble qu'aucune unité d'organisation n'ait été associé à votre programme 'Paludisme'.

source: It seems that you have not assigned one or more of your data elements to your Malaria program.
fr_ca: Il semble qu'aucun élément de données n'ait été a à votre programme 'Paludisme'.

source: It seems that you have not created an option set for your data elements that have been assigned to your Malaria program.
fr_ca: Il semble qu'aucun ensemble d'options n'ait été créé pour les éléments de données qui ont été attribués à votre programme 'Paludisme'.

source: It seems that you have not created options for your option set.
fr_ca: Il semble qu'aucune option n'ait été créée pour votre ensemble d'options.

source: It seems like your program's data elements are not added to groups, or they are not of the Tracker type.
fr_ca: Il semble que les éléments de données de votre programme ne soient pas ajoutés aux groupes, ou qu'ils ne soient pas du type Tracker.

source: It seems you have not created a section form for your Malaria program.
fr_ca: Il semble qu'aucun formulaire de section n'ait été créé pour votre programme 'Paludisme'.

source: It seems you have not assigned your user access to your Malaria program. Please check the sharing settings for your program and that you have access to both data and metadata.
fr_ca: Il semble que vous n'ayez pas attribué à votre utilisateur l'accès à votre programme 'Paludisme'. Veuillez vérifier les paramètres de partage de votre programme et vous assurer que vous avez accès à la fois aux données et aux métadonnées.

source: It seems that you have not created an event or have not entered any data into it for your Malaria program.
fr_ca: Il semble qu'aucun événement n'ait été créé ou qu'aucune donnée n'ait été saisie dans votre programme 'Paludisme'.
