Repository: pypi-data/pypi-mirror-243
Catalog: packages/feincms3-meta/feincms3_meta-4.6.0.tar.gz/feincms3_meta-4.6.0/feincms3_meta/locale/*/LC_MESSAGES/django.po
Languages: de

source: title
de: Titel

source: Used for Open Graph and other meta tags.
de: Wird für Open Graph und andere Meta-Tags verwendet.

source: description
de: Beschreibung

source: Override the description for this page.
de: Die Beschreibung dieser Seite explizit setzen.

source: image
de: Bild

source: Set the Open Graph image.
de: Das Open Graph Bild setzen.

source: canonical URL
de: kanonische URL

source: If you need this you probably know.
de: Sie werden selbst wissen ob Sie dies benötigen.

source: author
de: Autor*in

source: Override the author meta tag.
de: Das Meta-Tag für den Autor*innennamen überschreiben.

source: Override the robots meta tag.
de: Das Meta-Tag für die Robots (Suchmaschinen-Crawler) überschreiben.
